data <- read.csv("./datasets/DataV.csv", encoding = "UTF-8")
data <- subset(data, select=c(-1))
colnames(data) <- c("исход", "пол","возраст", "ИВЛ", "Ковид",  "оценка_тяжести",  "тяжесть",  "Онкология", "АГ",  "ИБС", "ИМ", "СД",  "ХОБЛ ", "ЖА ", "Пред_аритмия",  "ФП ", "ИМ_ковид", "Миокардит_ковид",  "ЖТ_ковид", "ЖТ_ИМ",  "ОНМК_ковид", "тромбозы_ковид", "гематомы_ковид", "ХСН_ковид",  "Пар_ФП_ковиде", "СПОН_ковиде", "ИВЛ_ковид",  "АД_систол", "АД_диастол", "D.димер",  "тропонин", "ферритин",  "фибриноген", "ЛДГ",  "соэ", "СРБ",  "ЛЦ", "Трц", "Калий",  "СКФ", "креатинин", "пор_легких",  "перегруз_ПЖ", "ПЖ", "TAPSE",  "ЧСС", "НСР", "низк_вольт",  "Ритм",  "ось_сердца",  "угол_альфа", "Увелич_ЛП", "Увелич_ПП", "ГЛЖ",  "ГПЖ", "перегруз_правых_отделов", "QTc",  "QIII.SI", "поворот_верхушкой.SI.SII.SIII", "поворот_ПЖ",  "АВ_бл", "Рубцовые_изм.нижн ",  "Депр_ишемич_ST", "изм_ST_T", "колво_отвед_ST",  "ФРРЖ", "макроальтернация",  "изм_фазы_реполяризации", "ПБЛНПГ",  "НБЛНПГ", "БПВР_ЛНПГ", "БЗНР_ЛНПГ", "ПБПНПГ",  "НБПНПГ", "неспец.в.ж.бл", "Пред.эктопия",  "Од.Пред.эктопия.колич", "парн_пред_эктопия_колич", "желуд_эктопия",  "од_ЖА_колич", "ПарнЖА_колич", "ИВЛ_2",  "проц_легких","горм_тер", "сурфактант", "моноклон_антитела",  "тяжесть_исх",  "ст_стяж_КТ_исх",  "стадия_КТ_исх",  " стадия_КТ_фин_тяж",  " стадия_КТ_фин_прогр",  "ритм_исх", "ритм.фп.тп_исх",  "ритм_фин", "ритм.фп.тп_фин",  "ритм_вып", "ритм.фп.тп_вып" )

cols <- c("возраст", "АД_диастол", "тяжесть", "исход")

df <- data[, cols]
head(data)

df <- scale(na.omit(df))
# str(df)
# View(data)
# str(df$исход)

# head(df)
sigma <- cov(df)

sigma

ei <- eigen(sigma)

ei$values / sum(ei$values) * 100

Y <- df %*% ei$vectors #[,1:4]

ei$vectors
X <- ei$vectors %*% diag(sqrt(ei$values))

rownames(X) <- cols
X
Y

PR <- princomp(df, cor = TRUE)

PR$loadings
PR$scores

PR$sdev
cbind(PR$sdev^2, ei$values)


plot(Y[,1], Y[,2], type = "p")


X1 <- t(ei$vectors[,1:4] %*% t(Y))
X1

Z0 <- t(ei$vectors %*% t(df))
Z <- Z0 %*% ei$vectors

# head(cor(X1[,1], )
head(X1)
head(df)

cor(X1[,1:4],df[,1:4])

